# GetConditionImage Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..GetConditionImage Method
FabricationServiceButton Class See Also
---
Gets the image for the specified fabrication service button condition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public virtual Bitmap GetConditionImage(
	int condition
)
```

Visual Basic
---
```text
Public Overridable Function GetConditionImage ( _
	condition As Integer _
) As Bitmap
```

Visual C++
---
```text
public:
virtual Bitmap^ GetConditionImage(
	int condition
)
```

# ### Parameters
condition
    Type: System..::..Int32The condition index.
# ### Return Value
System.Drawing.Bitmap represents the fabrication service button image. nullNothingnullptra null reference (Nothing in Visual Basic) if there is no preview image.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the index condition is not larger or equal to 0 and less than ConditionCount |

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace